nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core1.xml
        <register>
          <name>LIFECYCLE</name>
          <description>Lifecycle Fuse Word</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF038FF</resetMask>
          <fields>
            <field>
              <name>CLC</name>
              <description>Converged Lifecycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>blank</name>
                  <description>BLANK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fab</name>
                  <description>NXP Fab</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prov</name>
                  <description>NXP Provisioned</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>open</name>
                  <description>OEM Open</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swc</name>
                  <description>OEM Secure World Closed</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>closed</name>
                  <description>OEM Closed</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>oemr</name>
                  <description>OEM Return</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ret</name>
                  <description>NXP Return</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>OEM Locked</description>
                  <value>0x9F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>brick</name>
                  <description>BRICK</description>
                  <value>#11xxxxxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_EN_LOCK</name>
              <description>Debug Enable Lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>The debug access control registers remain open when jumping to customer code.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>The debug access control registers are write-locked before jumping to customer code.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_AUTH_DIS</name>
              <description>Debug Authentication Disabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Debug Authentication enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Debug Authentication disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZM_EN</name>
              <description>Trust Zone Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>TZ-M is disabled by default, can be enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>TZ-M is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBU_SEC_BOOT_EN</name>
              <description>NBU Secure Boot Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, NBU image doesn't need to be authenticated (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled, NBU image must be authenticated to boot.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERIAL_DIS</name>
              <description>Serial Download Disabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Serial download path is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Serial download path is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP_DIS</name>
              <description>Wakeup Disabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Boot-ROM LP wakup is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Boot-ROM LP wakup is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRK_REVOKE</name>
              <description>Revocation indicator from OEM Firmware Authentication Public Key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OEM_SEC_BOOT_EN</name>
              <description>Main Core Secure Boot Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, Boot image doesn't need to be authenticated to boot (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled, Boot image must be authenticated to boot.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWD_ID</name>
              <description>Serial Wire Debug Instance ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIFECYCLE_B</name>
          <description>Lifecycle Fuse Word Complement</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF038FF</resetMask>
          <fields>
            <field>
              <name>CLC_B</name>
              <description>Converged Lifecycle Complement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>brick</name>
                  <description>BRICK</description>
                  <value>#00xxxxxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>OEM Locked</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ret</name>
                  <description>NXP Return</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>oemr</name>
                  <description>OEM Return</description>
                  <value>0xC0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>closed</name>
                  <description>OEM Closed</description>
                  <value>0xE0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swc</name>
                  <description>OEM Secure World Closed</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>open</name>
                  <description>OEM Open</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prov</name>
                  <description>NXP Provisioned</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fab</name>
                  <description>NXP Fab</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>blank</name>
                  <description>BLANK</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_EN_LOCK_B</name>
              <description>Debug Enable Lock Complement</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>The debug access control registers are write-locked before jumping to customer code.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>The debug access control registers remain open when jumping to customer code.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_AUTH_DIS_B</name>
              <description>Debug Authentication Disabled Complement</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Debug Authentication disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Debug Authentication enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZM_EN_B</name>
              <description>Trust Zone Mode Enable Complement</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>TZ-M is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>TZ-M is disabled by default, can be enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBU_SEC_BOOT_EN_B</name>
              <description>NBU Secure Boot Enable Complement</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled, NBU image must be authenticated to boot.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, NBU image doesn't need to be authenticated (default).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERIAL_DIS_B</name>
              <description>Serial Download Disabled Complement</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Serial download path is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Serial download path is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP_DIS_B</name>
              <description>Wakeup Disabled Complement</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Boot-ROM LP wakup is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Boot-ROM LP wakup is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRK_REVOKE_B</name>
              <description>Revocation indicator from OEM Firmware Authentication Public Key Complement</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OEM_SEC_BOOT_EN_B</name>
              <description>Main Core Secure Boot Enable Complement</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled, Boot image must be authenticated to boot.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, Boot image doesn't need to be authenticated to boot (default).</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWD_ID_B</name>
              <description>Serial Wire Debug Instance ID Complement</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_LOCKOUT</name>
          <description>ROM Lockout Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROMWA</name>
              <description>ROM Watermark Address</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGLOCK</name>
              <description>ROM_LOCKOUT Register Lock (DFF3 bitfield)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>wlock_0</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_1</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_2</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_3</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_4</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>w5c</name>
                  <description>Writing this value has no effect.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wlock_7</name>
                  <description>Lock ROM_LOCKOUT register.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTR</name>
          <description>Security Counter Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data, 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRP1</name>
          <description>Security Counter Plus 1 Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DONTCARE32</name>
              <description>Don't Care Data, 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRM1</name>
          <description>Security Counter Minus 1 Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DONTCARE32</name>
              <description>Don't Care Data, 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRPX</name>
          <description>Security Counter Plus X Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data, 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTRMX</name>
          <description>Security Counter Minus X Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data, 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
