nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core1.xml
        <register>
          <name>GICHR</name>
          <description>Global Interrupt Control High</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GIWE16</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE17</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE18</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE19</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE20</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE21</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE22</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE23</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE24</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE25</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE26</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE27</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE28</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE29</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE30</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE31</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>giwe0</name>
                  <description>Not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>giwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWD</name>
              <description>Global Interrupt Write Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
